EN = {
    "wait": "**♻️ Please Wait ...**",
    "On": "Actived (✔️)",
    "Off": "DeActived (✖️)",
    "LargeSize": "**✘ The File Size Must Be Less Than From:** ( `{}` )",
    "OtherCallback": "🚫 This Is Not Created For You!",
    "OtherInline": "**🚫 This Is Not Created For You!**\n\n**• Don't Use From Bot!**",
    "only": {
        "Pv": "**❉ Please Use This Command Only In The Private Chats!**",
        "Group": "**❉ Please Use This Command Only In The Groups!**",
        "Channel": "**❉ Please Use This Command Only In The Channels!**",
    },
    "reply": "**❉ Please Reply To {}!**",
    "replytext": "**❉ Please Reply To A Text Message!**",
    "replymedia": "**❉ Please Reply To A Media!**",
    "user": {
        "all": "**❉ Please Reply To User Or Enter UserID - Username Or Send In Pv!**",
        "reply": "**❉ Please Reply To User!**",
        "replyid": "**❉ Please Reply To User Or Enter UserID - Username!**",
    },
    "chat": {
        "all": "**❉ Please Enter ChatID - ChatUsername Or Send In The Chat!**",
        "id": "**❉ Please Enter ChatID - ChatUsername!**",
    },
    "inline": {
        "On": "( ✔️ )",
        "Off": "( ✖️ )",
        "Yes": "Yes ✅",
        "No": "No ❌",
        "Close": "🚫 Close 🚫",
        "NextPage": "Next ▶️",
        "BackPage": "◀️ Back",
        "Back": "🔙 Back",
        "Delete": "🗑️ Delete 🗑️",
        "Clean": "🗑️ Clean 🗑️",
        "Show": "💡 This Button Is Only For Show!",
    },
    "progress": {
        "Text": "`{}`\n\n[ `{}` ] `{}%`\n\n**🗃️ Size:** ( `{}` ) - ( `{}` )\n**🚅 Speed:** ( `{}` )\n**⏳ ETA:** ( `{}` )\n**⏰ Duration:** ( `{}` )",
        "Down": "📥 Downloading",
        "Up": "📤 Uploading",
    },
}

FA = {
    "wait": "**♻️ لطفا صبر کنید ...**",
    "On": "فعال شد (✔️)",
    "Off": "غیر فعال شد (✖️)",
    "LargeSize": "**✘ حجم فایل شما بیشتر از حد مجاز:** ( `{}` ) **است!**",
    "OtherCallback": "🚫 این دکمه برای شما ساخته نشده است!",
    "OtherInline": "**🚫 این ربات برای شما ساخته نشده است!**\n\n**• لطفا از ربات استفاده نکنید!**",
    "only": {
        "Pv": "**❉ این دستور فقط برای استفاده در پیوی است!**",
        "Group": "**❉ این دستور فقط برای استفاده در گروه است!**",
        "Channel": "**❉ این دستور فقط برای استفاده در چنل است!**",
    },
    "reply": "**❉ لطفا روی یک {} ریپلای کنید!**",
    "replytext": "**❉ لطفا روی یک نوشته ریپلای کنید!**",
    "replymedia": "**❉ لطفا روی یک فایل یا مدیا ریپلای کنید!**",
    "user": {
        "all": "**❉ لطفا روی یک کاربر ریپلای کنید و یا آیدی یا یوزرنیم یک کاربر را وارد کنید یا در یک پیوی ارسال کنید!**",
        "reply": "**❉ لطفا روی یک کاریر ریپلای کنید!**",
        "replyid": "**❉ لطفا روی یک کاربر ریپلای کنید و یا آیدی یا یوزرنیم یک کاربر را وارد کنید!**",
    },
    "chat": {
        "all": "**❉ لطفا آیدی یا آیدی عددی یک چت را وارد کنید و یا در یک چت ارسال کنید!**",
        "id": "**❉ لطفا آیدی یا آیدی عددی یک چت را وارد کنید!**",
    },
    "inline": {
        "On": "( ✔️ )",
        "Off": "( ✖️ )",
        "Yes": "بله ✅",
        "No": "خیر ❌",
        "Close": "🚫 بستن 🚫",
        "NextPage": "بعدی ▶️",
        "BackPage": "◀️ قبلی",
        "Back": "🔙 برگشتن",
        "Delete": "🗑️ پاک کردن 🗑️",
        "Clean": "🗑️ پاکسازی 🗑️",
        "Show": "💡 این دکمه فقط برای نمایش است!",
    },
    "progress": {
        "Text": "`{}`\n\n[ `{}` ] `{}%`\n\n**🗃️ حجم:** ( `{}` ) - ( `{}` )\n**🚅 سرعت:** ( `{}` )\n**⏳ زمان باقیمانده:** ( `{}` )\n**⏰ زمان سپری شده:** ( `{}` )",
        "Down": "📥 درحال دانلود",
        "Up": "📤 درحال آپلود",
    },
}

STRINGS = {
    "EN": EN,
    "FA": FA,
}